**Adding the data to the correct Tables**

In [193]:
%load_ext sql
%sql sqlite:///CourseData.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @CourseData.db'

In [194]:
%%sql
INSERT INTO INSTRUCTOR (primary_instructor)
SELECT DISTINCT primary_instructor
FROM import_courses;

 * sqlite:///CourseData.db
1105 rows affected.

[]

In [195]:
%%sql
INSERT INTO CATALOG_DESC (catalog_id, program_code, program_name, course_title, prereqs, coreqs, fees, attributes, description, catalog_year)
SELECT catalog_id, program_code, program_name, course_title, prereqs, coreqs, fees, attributes, description, catalog_year
FROM import_catalogs;

 * sqlite:///CourseData.db
4441 rows affected.

[]

In [196]:
%%sql
SELECT *
FROM INSTRUCTOR
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(1, 'Michael P.  Coyne'),
 (2, 'Rebecca I.  Bloch'),
 (3, 'Paul   Caster'),
 (4, 'Jo Ann   Drusbosky'),
 (5, 'Arleen N.  Kardos'),
 (6, 'Scott M  Brenner'),
 (7, 'Kevin C.  Cassidy'),
 (8, 'Bruce   Bradford'),
 (9, 'Milo W.  Peck'),
 (10, 'Stephen E.  Yost')]

In [197]:
%%sql
INSERT INTO COURSE_OFFERING (CRN, term, section, title, credits, cap, act, rem, meetings, timecodes, instructor_id, catalog_desc_id)
SELECT CRN, term, section, title, credits, cap, act, rem, meetings, timecodes, instructor_id, catalog_desc_id
    FROM import_courses
    JOIN INSTRUCTOR ON (import_courses.primary_instructor=INSTRUCTOR.primary_instructor)
    JOIN CATALOG_DESC ON (import_courses.catalog_id=CATALOG_DESC.catalog_id);

 * sqlite:///CourseData.db
30504 rows affected.

[]

In [198]:
%%sql
SELECT *
FROM import_course_meetings
LIMIT 2;

 * sqlite:///CourseData.db
Done.

[('Fall2014', '70384', 'DSB 105', 'T', '2014-09-02T08:00:00', '2014-09-02T09:15:00'),
 ('Fall2014', '70384', 'DSB 105', 'F', '2014-09-05T08:00:00', '2014-09-05T09:15:00')]

In [199]:
%%sql
SELECT *
FROM import_courses
LIMIT 2;

 * sqlite:///CourseData.db
Done.

[('Fall2014', '70384', 'AC 0011', 'C01', '3.000', 'Introduction to Financial Accounting', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'Michael P.  Coyne', '0', '31', '-31'),
 ('Fall2014', '70385', 'AC 0011', 'C02', '3.000', 'Introduction to Financial Accounting', "[{'days': 'TF', 'times': '0930am-1045am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0930am-1045am 09/02-12/08 DSB 105']", 'Michael P.  Coyne', '0', '31', '-31')]

In [202]:
%%sql
INSERT INTO COURSE_MEETING (course_offering_id, location, day, start, end)
SELECT course_offering_id, location, day, start, end
    FROM import_course_meetings
    JOIN COURSE_OFFERING ON (import_course_meetings.CRN=COURSE_OFFERING.CRN AND import_course_meetings.term=COURSE_OFFERING.term);

 * sqlite:///CourseData.db
609894 rows affected.

[]

In [6]:
#%%sql
SELECT COUNT(DISTINCT primary_instructor)
FROM INSTRUCTOR;

 * sqlite:///CourseData.db
Done.

[(1105,)]

In [7]:
#%%sql
SELECT COUNT(DISTINCT section), primary_instructor 
FROM COURSE_OFFERING 
WHERE term = 'Fall2018';

 * sqlite:///CourseData.db
Done.

[(121, 'Michael P.  Coyne')]

In [ ]:
%%sql
INSERT INTO COURSE_OFFERING (CRN, catalog_id, term, section, title, credits, cap, act, rem, meetings, timecodes, primary_instructor)
SELECT CRN, catalog_id, term, section, title, credits, cap, act, rem, meetings, timecodes, primary_instructor
FROM import_courses;